# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development
brew 'php'
brew 'php@7.2'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'node@8'
brew 'npm'
brew 'redis'
brew 'yarn'

# Apps
# 'brew search --casks slack'
# 'brew info slack'
# 'brew cask install slack'
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'insomnia'
cask 'java'
cask 'mysqlworkbench'
cask 'phpstorm'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram-desktop'
# cask 'tor-browser'
# cask 'transmission'
# cask 'transmit'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'nagstamon'
cask 'pibakery'
cask 'balenaetcher'
cask 'tunnelblick'
cask 'sdformatter'
cask 'keepassxc'
cask 'zeplin'
cask 'zoomus'
cask 'anydesk'
cask 'spectacle'
cask 'jetbrains-toolbox'
cask 'synology-drive'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store (mas search <app>) > 'mas search telegram'
# mas '1Password', id: 1333542190
# mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
# mas 'Sip', id: 507257563
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005
mas 'WhatsApp', id: 1147396723
mas 'Telegram', id: 747648890
mas 'iLightShow for Philips Hue', id: 1217138942
# Xcode has to be installed before using the install procedure
# mas 'Xcode', id: 497799835
mas 'Cyberduck', id: 409222199
# moom replaced by 'Spectacle'
# mas 'Moom', id: 419330170

# Not (yet) installable packages
# dockerstation
# binance
